art_project/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def index
        # @artworks =Artwork.all
        user = User.find(params[:id])

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "smile"], ["image_url", "https://tinyurl.com/y2z8kak3\n"], ["artist_id", 16]]
---
    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "stolen_smile"], ["id", 13]]
---
    def update
        @artwork = Artwork.find(params[:id])
        @artwork.update(artwork_params)